

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура тм_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Права = тм_КЭШ.ПолучитьПраваОбъекта("ЗаказПокупателя", Пользователи.ТекущийПользователь());
	Если Не Права.SA Тогда
		ОтключитьВозможностьПроведениеДокументов();		
	КонецЕсли; 
	
	ДобавитьВставитьЭлементыНаФорму();
	
	//УстановитьОтборы();
	
	ГруппаФормаСоздатьНаОсновании = Элементы.ГруппаГлобальныеКомандыЗаказПокупателя.ПодчиненныеЭлементы.Найти("ФормаСоздатьНаОсновании");
	Если ГруппаФормаСоздатьНаОсновании <> Неопределено Тогда
		
		ЭлементыГруппы = ГруппаФормаСоздатьНаОсновании.ПодчиненныеЭлементы;
		ЭлементПоступленияНаСчет = ЭлементыГруппы.Найти("ФормаДокументПоступлениеНаСчетСоздатьНаОсновании");
		
		Если ЭлементПоступленияНаСчет <> Неопределено Тогда
			Элементы.Переместить(ЭлементПоступленияНаСчет, ГруппаФормаСоздатьНаОсновании, ЭлементыГруппы.ФормаДокументСобытиеСоздатьНаОсновании);
			ЭлементПоступленияНаСчет.Доступность  = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
		 
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура тм_ПриОткрытииПосле(Отказ)
	
	тм_УправлениеДоступом();

КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборАвтомобильПриИзменении(Элемент)
	
	//Если ПустаяСтрока(Элемент.ТекстРедактирования) Тогда
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Автомобиль");  	
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автомобиль", ЭтотОбъект.тм_ОтборАвтомобиль, ВидСравненияКомпоновкиДанных.Равно,, Истина); 		
	//КонецЕсли; 	
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура тм_УправлениеДоступом()
	
	Если Не тм_ОбщегоНазначенияВызовСервера.ВключенаФункциональнаяОпция("тм_ИспользованиеФункционалаЧата") Тогда	
		тм_РаботаСФормойКлиент.ОтключитьВидимостьЭлементов(ЭтотОбъект, "ФормаОбщаяКомандатм_Чат");	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОтключитьВозможностьПроведениеДокументов()

	//Отключаем из выбора "Контекстное меню"
	СписокКонтекстноеМенюГруппаСтандартные = Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("СписокКонтекстноеМенюГруппаСтандартные"); 
	Если Не СписокКонтекстноеМенюГруппаСтандартные = Неопределено Тогда
		СписокКонтекстноеМенюГруппаПроведение = СписокКонтекстноеМенюГруппаСтандартные.ПодчиненныеЭлементы.Найти("СписокКонтекстноеМенюГруппаПроведение");
		Если Не СписокКонтекстноеМенюГруппаПроведение = Неопределено Тогда
			Для каждого Элемент Из СписокКонтекстноеМенюГруппаПроведение.ПодчиненныеЭлементы Цикл
				Элемент.Доступность = Ложь;
			КонецЦикла;  
		КонецЕсли; 
	КонецЕсли; 
	
	//Отключаем из выбора "Еще"
	ГруппаКоманднаяПанель = ЭтаФорма.ПодчиненныеЭлементы.Найти("ГруппаКоманднаяПанель");
	Если Не ГруппаКоманднаяПанель = Неопределено Тогда
		ФормаГруппаПроведение = ГруппаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаГруппаПроведение");
		Если Не ФормаГруппаПроведение = Неопределено Тогда
			Для каждого Элемент Из ФормаГруппаПроведение.ПодчиненныеЭлементы Цикл
				Элемент.Доступность = Ложь;
			КонецЦикла;  
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОтключитьВозможностьПроведениеДокументов()
 
&НаСервере
Процедура ДобавитьВставитьЭлементыНаФорму()

	Список.ТекстЗапроса = тм_ПереопределяемыйСервер.ПереопределитьТекстЗапросаДинамическогоСписка("ФормаСпискаЗаказНаряда", Список.ТекстЗапроса);
	
	// Поле автомобиль
	ЭлементАвтомобиль = тм_ОбщегоНазначенияВызовСервера.ДобавитьЭлементНаФорму(
		ЭтаФорма,
		"тм_Автомобиль",
		Тип("ПолеФормы"),
		ВидПоляФормы.ПолеВвода,
		Элементы.Список,
		"Список.Автомобиль");   
		
	ЭлементАвтомобиль.Заголовок = "Автомобиль";

	// Номер телефона
	ЭлементНомерТелефона = тм_ОбщегоНазначенияВызовСервера.ДобавитьЭлементНаФорму(
		ЭтаФорма,
		"тм_НомерТелефона",
		Тип("ПолеФормы"),
		ВидПоляФормы.ПолеВвода,
		Элементы.Список,
		"Список.НомерТелефона");   
		
	ЭлементНомерТелефона.Заголовок = "Номер телефона";

	// Чат
	Если тм_ОбщегоНазначенияВызовСервера.ВключенаФункциональнаяОпция("тм_ИспользованиеФункционалаЧата") Тогда
		ЭлементЧат= тм_ОбщегоНазначенияВызовСервера.ВставитьЭлементНаФорму(
			ЭтаФорма,
			"тм_Чат",
			Тип("ПолеФормы"),
			ВидПоляФормы.ПолеКартинки,
			Элементы.Список,
			"Список.Чат",
			Элементы.ЕстьФайлы);   
			
		ЭлементЧат.Заголовок = "Чат";
		ЭлементЧат.Доступность = Ложь;
		ЭлементЧат.КартинкаШапки = БиблиотекаКартинок.Сообщение;
		ЭлементЧат.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементЧат.КартинкаЗначений = БиблиотекаКартинок.Сообщение;
	КонецЕсли; 
	// Поле VIN

	//ЭлементАвтомобильVIN = тм_ОбщегоНазначенияСервер.ДобавитьЭлементНаФорму(
	//	ЭтаФорма,
	//	"тм_VIN",
	//	Тип("ПолеФормы"),
	//	ВидПоляФормы.ПолеВвода,
	//	Элементы.Список,
	//	"Список.VIN");   
	//	
	//ЭлементАвтомобильVIN.Заголовок = "VIN";
	
	
	// Отбор по автомобилю
	//ГруппаОтборАвтобиль = тм_ОбщегоНазначенияСервер.ВставитьЭлементНаФорму(
	//	ЭтаФорма,
	//	"тм_ГруппаОтборАвтобиль",
	//	Тип("ГруппаФормы"),
	//	ВидГруппыФормы.ОбычнаяГруппа,
	//	Элементы.ФильтрыНастройкиИДопИнфо,
	//	"",
	//	Элементы.ДекорацияПустойОтступ
	//	);
	//	
	//ГруппаОтборАвтобиль.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//ГруппаОтборАвтобиль.Отображение = ОтображениеОбычнойГруппы.Нет;
	//ГруппаОтборАвтобиль.ОтображатьЗаголовок = Ложь;
	//
	//// Элемент отбора	автомобиля
	//ДобавляемыеРеквизиты = Новый Массив;                   
	//	
	////Реквизит_тм_ОтборАвтомобиль = Новый РеквизитФормы("тм_ОтборАвтомобиль", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	//Реквизит_тм_ОтборАвтомобиль = Новый РеквизитФормы("тм_ОтборАвтомобиль", Новый ОписаниеТипов("СправочникСсылка.тм_АвтомобилиКлиентов"));
	//
	//ДобавляемыеРеквизиты.Добавить(Реквизит_тм_ОтборАвтомобиль);
	//
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты);		
	//	
	//ЭлементОтборАвтомобиль = тм_ОбщегоНазначенияСервер.ДобавитьЭлементНаФорму(
	//	ЭтаФорма,
	//	"тм_ОтборАвтомобиль",
	//	Тип("ПолеФормы"),
	//	ВидПоляФормы.ПолеВвода,
	//	Элементы.тм_ГруппаОтборАвтобиль,
	//	"тм_ОтборАвтомобиль");
		
	//ЭлементОтборАвтомобиль.ПодсказкаВвода = "Автомобиль";
	//ЭлементОтборАвтомобиль.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//ЭлементОтборАвтомобиль.КнопкаОткрытия = Ложь;
	//ЭлементОтборАвтомобиль.КнопкаОчистки  = Истина;
	//
	//ЭлементОтборАвтомобиль.УстановитьДействие("ПриИзменении", "ОтборАвтомобильПриИзменении");
	
КонецПроцедуры // ДобавитьВставитьЭлементыНаФорму()

//@skip-warning
&НаСервере
Процедура УстановитьОтборы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ДоступКПросмотруДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.тм_ДоступКПросмотру.Документы КАК тм_ДоступКПросмотруДокументы
		|ГДЕ
		|	тм_ДоступКПросмотруДокументы.НаименованиеДокумента ПОДОБНО &НаименованиеДокумента
		|	И тм_ДоступКПросмотруДокументы.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("НаименованиеДокумента", "ЗаказПокупателя");
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Пользователи.ТекущийПользователь());  		
	КонецЕсли; 
	 
КонецПроцедуры // УстановитьОтборы()

#КонецОбласти 