
&После("УстановитьПрефикс")
Процедура тм_УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда	
		Префикс = СтрЗаменить(Префикс, "НФ", "РН");				
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		Если Источник.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			Префикс = СтрЗаменить(Префикс, "НФ", "ЗН");	
		ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу Тогда
			Префикс = СтрЗаменить(Префикс, "НФ", "ЗП");	
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
