
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ГосударственныйНомер = ВРЕГ(ТекущийОбъект.ГосударственныйНомер);
	ТекущийОбъект.VIN = ВРЕГ(ТекущийОбъект.VIN);
	ТекущийОбъект.Регион = ВРЕГ(ТекущийОбъект.Регион);
	ТекущийОбъект.НомерКузова = ВРЕГ(ТекущийОбъект.НомерКузова);
	ТекущийОбъект.НомерДвигателя = ВРЕГ(ТекущийОбъект.НомерДвигателя);
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГосударственныйНомерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст);
	Если Отказ Тогда
		Объект.ГосударственныйНомер = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура VINИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст, Ложь);
	Если Отказ Тогда
		Объект.VIN = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКузоваИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст, Ложь);
	Если Отказ Тогда
		Объект.НомерКузова = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДвигателяИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	ПроверитьВводРеквизита(Элемент.Имя, Отказ, Текст, Ложь);
	Если Отказ Тогда
		Объект.НомерДвигателя = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура АвтомобильПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Автомобиль) Тогда
		Объект.МаркаАвто = Неопределено;
		Объект.МодельАвто = Неопределено;
		Объект.МодельДвигателя = Неопределено;
	Иначе
		Объект.МаркаАвто = Объект.Автомобиль.МаркаАвто;
		Объект.МодельАвто = Объект.Автомобиль.МодельАвто;
		Объект.МодельДвигателя = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	АвтомобильПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаКлиенте
Процедура ПроверитьВводРеквизита(ПроверяемыйРеквизит, Отказ, Текст, ПроверитьТолькоКириллица = Истина)

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;  
	
	ДопустимыеСимволы = "0123456789";
	Если ПроверитьТолькоКириллица Тогда			
		Если Не СтроковыеФункцииКлиентСервер.ТолькоКириллицаВСтроке(Текст,, ДопустимыеСимволы) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо вводить символы русского языка";
			Сообщение.Поле  = ПроверяемыйРеквизит;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить(); 
		КонецЕсли; 			
	Иначе
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Текст,, ДопустимыеСимволы) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо вводить символы английского языка";
			Сообщение.Поле = ПроверяемыйРеквизит;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();	
		КонецЕсли;			
	КонецЕсли; 		

КонецПроцедуры

#КонецОбласти 





