
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура тм_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьВставитьЭлементыНаФорму();
	                                                                                           
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура тм_СписокЗапасыПриАктивизацииСтрокиПосле(Элемент)
	
	ЗаполнитьДополнительнуюТаблицу(Элемент.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_АналогиВместо(Команда)
	
	Если Элементы.Аналоги.Пометка Тогда
		УстановитьОчиститьОтбор(Ложь);
		Элементы.Аналоги.Пометка = Ложь;
	Иначе	
		Номенклатура = Элементы.СписокЗапасы.ТекущаяСтрока;
		Аналоги = НайтиАналогиНоменклатуры(Номенклатура);
		УстановитьОчиститьОтбор(, Аналоги);    
		Элементы.Аналоги.Пометка = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НайтиАналогиНоменклатуры(Номенклатура)

	Аналоги = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналогиНоменклатуры.Аналог КАК Аналог
		|ИЗ
		|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|ГДЕ
		|	АналогиНоменклатуры.Номенклатура = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АналогиНоменклатуры.Номенклатура
		|ИЗ
		|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|ГДЕ
		|	АналогиНоменклатуры.Аналог = &Номенклатура";
		
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Аналоги.Добавить(Выборка.Аналог);		
		КонецЦикла;
	КонецЕсли; 
	
	Возврат Аналоги;
	
КонецФункции // НайтиАналогиНоменклатуры()
 
&НаСервере
Процедура УстановитьОчиститьОтбор(УстановитьОтбор = Истина, Аналоги = Неопределено)

	Если УстановитьОтбор Тогда
		ЭлементОтбора = СписокЗапасы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Аналоги;
	Иначе
		СписокЗапасы.Отбор.Элементы.Очистить();
	КонецЕсли; 

КонецПроцедуры // УстановитьОчиститьОтбор()

&НаСервере
Процедура ДобавитьВставитьЭлементыНаФорму()

	//СписокЗапасы.ТекстЗапроса = тм_ПереопределяемыйСервер.ПереопределитьТекстЗапросаДинамическогоСписка("Номенклатура");
	//
	//Производитель = тм_ОбщегоНазначенияСервер.ДобавитьЭлементНаФорму(ЭтаФорма, "тм_Производитель", Тип("ПолеФормы"),, Элементы.СписокЗапасы, "СписокЗапасы.тм_Производитель");   
	//Производитель.Заголовок = "Производитель";
	//
	//СвойствоПроизводитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Производитель_DaCar");
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗапасы, "СвойствоПроизводитель",  СвойствоПроизводитель);
	
	ДобавляемыеРеквизиты	= Новый Массив;                   
		
    тм_ДополнительнаяТаблица = Новый РеквизитФормы("тм_ДополнительнаяТаблица", Новый ОписаниеТипов("ТаблицаЗначений"));
    ДобавляемыеРеквизиты.Добавить(тм_ДополнительнаяТаблица);
	
	
	Колонка1 = Новый РеквизитФормы("Производитель", Новый ОписаниеТипов("Строка"), "тм_ДополнительнаяТаблица"); 
	ДобавляемыеРеквизиты.Добавить(Колонка1);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);	
	
	// добавим элементы формы
	//ДопТаблица =  тм_ОбщегоНазначенияСервер.ВставитьЭлементНаФорму(ЭтаФорма, 
	//	"тм_ДополнительнаяТаблица",
	//	Тип("ТаблицаФормы"),,Элементы.НоменклатураИОтборы,"тм_ДополнительнаяТаблица", Элементы.ПраваяПанель); 

	ДопТаблица =  тм_ОбщегоНазначенияВызовСервера.ДобавитьЭлементНаФорму(ЭтаФорма, 
		"тм_ДополнительнаяТаблица",
		Тип("ТаблицаФормы"),,Элементы.СпискиНоменклатуры,"тм_ДополнительнаяТаблица"); 
	
	// запретим менять положение строк и сами строки, отключим командную панель
	ДопТаблица.ИзменятьСоставСтрок = Ложь;
	ДопТаблица.ИзменятьПорядокСтрок = Ложь;
	ДопТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

	
	Рек = Элементы.Добавить("КолонкаПроизводитель", Тип("ПолеФормы"), ДопТаблица);
	Рек.Вид = ВидПоляФормы.ПолеНадписи;
	Рек.ПутьКДанным = "тм_ДополнительнаяТаблица.Производитель";
	Рек.Заголовок = "Производитель";
	
КонецПроцедуры // ДобавитьВставитьЭлементыНаФорму()

&НаСервере
Процедура ЗаполнитьДополнительнуюТаблицу(Номенклатура)
	
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;	
	КонецЕсли; 
	
	СвойствоПроизводитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Производитель_DaCar");

	ДопТаблица = РеквизитФормыВЗначение("тм_ДополнительнаяТаблица");
	ДопТаблица.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Производитель
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НоменклатураДополнительныеРеквизиты.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", СвойствоПроизводитель );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДопТаблица.Добавить(), Выборка);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДопТаблица, "тм_ДополнительнаяТаблица");
	
КонецПроцедуры // ЗаполнитьДополнительнуюТаблицу()
 

#КонецОбласти 
