#Область ОписаниеПеременных

Перем тм_глПрава Экспорт;
Перем ИмяКаталогаВременныхФайловОкна Экспорт;

#КонецОбласти

&После("ПриНачалеРаботыСистемы")
Процедура тм_ПриНачалеРаботыСистемы()
	
	// Заполнение прав
	ЗаполнитьПрава(тм_глПрава);
	
	СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();
	Если СтрНайти(СтрокаСоединенияИнформационнойБазы, "Ref=""dacar_unf""") <> 0 		
		И тм_глПрава["ПолныеПрава"] Тогда
		//НеРазрешатьПодключение = Ложь;
		//ПараметрыПрерывания = тм_ОбщегоНазначенияСервер.ПолучитьСписокАктивныхПользователей();
		//
		//Если ПараметрыПрерывания.Свойство("НеРазрешатьПодключение") и ПараметрыПрерывания.НеРазрешатьПодключение Тогда
		//	ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗавершениеРаботыСистемы", тм_ОбщегоНазначенияКлиент),"Под пользователем "+Строка(ПараметрыПрерывания.Пользователь)+" на компьютере "+ПараметрыПрерывания.ИмяКомпьютера+" уже имеется соединение с данной базой."+Символы.ПС+"Работа системы будет завершена.",10);
		//	Возврат;
		//КонецЕсли;
		
	 	ОткрытьФорму("ОбщаяФорма.тм_СменаНастроекПользователя");
		
	КонецЕсли;
	
	// Чат
	Если тм_ОбщегоНазначенияВызовСервера.ВключенаФункциональнаяОпция("тм_ИспользованиеФункционалаЧата") Тогда
		ПодключитьОбработчикОжидания("ОповеститьПользователяОбИзменениях", 10, Истина);
	КонецЕсли; 
	
	// Восстановаление открытых окон
	Если тм_глПрава["ВосстанавливатьРанееОткрытыеВкладки"] Тогда
		тм_РаботаСФормойКлиент.ПриНачалеРаботыСистемы();	
	КонецЕсли;  
	
//	ОткрытьФорму("ОбщаяФорма.тм_НовостиКомпании");
		
КонецПроцедуры

&После("ПередЗавершениемРаботыСистемы")
Процедура тм_ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	тм_РаботаСФормойКлиент.ПередЗавершениемРаботыСистемы();
	
КонецПроцедуры

#Область Инициализация


#КонецОбласти