
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПоля();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект, Истина);
	СписокПользователей.ПоказатьОтметкуЭлементов(Оповещение, "Выберите пользователей");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	СписокОбъектов.ПоказатьОтметкуЭлементов(Оповещение, "Выберите объекты");
	
КонецПроцедуры

&НаКлиенте
Процедура ДальшеНажатие(Элемент)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбъекта;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Список, Параметры) Экспорт
	
	ВыборПользователя = ?(Параметры = Неопределено, Ложь, Истина);
	
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыборПользователя Тогда
		СписокВыбранныхПользователей.Очистить();
	Иначе
		ИмяОбъекта = "";
	КонецЕсли; 
	
	Для каждого Элемент из Список Цикл
		Если Элемент.Пометка Тогда
			Если ВыборПользователя Тогда
				СписокВыбранныхПользователей.Добавить(Элемент.Значение);
			Иначе
				ИмяОбъекта = ?(ПустаяСтрока(ИмяОбъекта), ИмяОбъекта + Элемент.Значение, ИмяОбъекта + "," + Элемент.Значение);
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоля()

	Для каждого мСправочники Из Метаданные.Справочники Цикл
		СписокОбъектов.Добавить(мСправочники.Имя, мСправочники.Синоним);
	КонецЦикла;  		
	
	Для каждого мДокументы Из Метаданные.Документы Цикл
		СписокОбъектов.Добавить(мДокументы.Имя, мДокументы.Синоним);
	КонецЦикла;  
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Наименование КАК Наименование,
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПользователей.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПолеОбъекта()

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("Пользователи", СписокВыбранныхПользователей.ВыгрузитьЗначения()); 
	ПараметрыПередачи.Вставить("Объекты", ИмяОбъекта); 
	ПараметрыПередачи.Вставить("Запись", Запись); 
	ПараметрыПередачи.Вставить("Чтение", Чтение);
	ПараметрыПередачи.Вставить("SA", SA);
	
	ОповеститьОВыборе(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбранныхПользователейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект, Истина);
	СписокПользователей.ПоказатьОтметкуЭлементов(Оповещение, "Выберите пользователей");
	
КонецПроцедуры

#КонецОбласти 
