
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//Поля.Добавить("МаркаАвто");
	//Поля.Добавить("МодельАвто");
	//Поля.Добавить("ГосударственныйНомер");
	
	//СтандартнаяОбработка = Ложь;
	//Поля.Добавить("Наименование");
	//Поля.Добавить("VIN");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	//Представление = Строка(Данные.МаркаАвто) + ", " + Строка(Данные.МодельАвто) + ", " + Данные.ГосударственныйНомер;
	
	//СтандартнаяОбработка = Ложь;
	//Представление = Данные.Наименование + ", " + Данные.VIN;
	
КонецПроцедуры
