
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПолеОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПолеОбъекта()

	Для каждого мДокументы Из Метаданные.Документы Цикл
		Элементы.Объект.СписокВыбора.Добавить(мДокументы.Имя);
	КонецЦикла;  	

КонецПроцедуры // ЗаполнитьПолеОбъекта()
 
#КонецОбласти 