

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура тм_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьВставитьЭлементыНаФорму();
	УстановитьИспользуемыеБонусы();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьВставитьЭлементыНаФорму()

	тм_ОбщегоНазначенияВызовСервера.ДобавитьЭлементНаФорму(ЭтаФорма,
		"НадписьИспользуемыеБонусы", 
		Тип("ДекорацияФормы"), ВидДекорацииФормы.Надпись, Элементы.СуммаВалюта, Неопределено);

КонецПроцедуры // ДобавитьВставитьЭлементыНаФорму()
  
&НаСервере
Процедура УстановитьИспользуемыеБонусы()

	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Или
		ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Элементы.НадписьИспользуемыеБонусы.Заголовок = Новый ФорматированнаяСтрока("Использованные бонусы: " + Объект.ДокументОснование.тм_ИспользованныеБонусы,
		,
		ЦветаСтиля.ЦветОсобогоТекста);
	КонецЕсли; 
	
КонецПроцедуры // УстановитьИспользуемыеБонусы()
 
#КонецОбласти 