
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тм_СообщенияПользователям.ПользовательОтКого = Пользователи.ТекущийПользователь();
	тм_СообщенияПользователям.ИдентификаторСообщения = XMLСтрока(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Не ЗначениеЗаполнено(тм_СообщенияПользователям.ПользовательКому) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле Кому'"),, "ПользовательКому", "тм_СообщенияПользователям"); 
		Возврат;
	ИначеЕсли ПустаяСтрока(тм_СообщенияПользователям.Сообщение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле Сообщение'"),, "Сообщение", "тм_СообщенияПользователям"); 
		Возврат;	
	КонецЕсли; 
	
	ЗаписатьНаСервере();
	Оповестить("ОбновитьСписокЧата");
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_СообщенияПользователям.Прочитано КАК Прочитано
		|ИЗ
		|	РегистрСведений.тм_СообщенияПользователям КАК тм_СообщенияПользователям
		|ГДЕ
		|	тм_СообщенияПользователям.ПользовательКому = &ПользовательКому
		|	И тм_СообщенияПользователям.ПользовательОтКого = &ПользовательОтКого
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	тм_СообщенияПользователям.Прочитано
		|ИЗ
		|	РегистрСведений.тм_СообщенияПользователям КАК тм_СообщенияПользователям
		|ГДЕ
		|	тм_СообщенияПользователям.ПользовательОтКого = &ПользовательКому
		|	И тм_СообщенияПользователям.ПользовательКому = &ПользовательОтКого";
	
	Запрос.УстановитьПараметр("ПользовательКому", тм_СообщенияПользователям.ПользовательКому);
	Запрос.УстановитьПараметр("ПользовательОтКого", тм_СообщенияПользователям.ПользовательОтКого);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Есть ранее созданные чаты. Удалите старые или продолжайте общение в старых :)'")); 
		Возврат ;
	КонецЕсли; 
	
	МЗ = РегистрыСведений.тм_СообщенияПользователям.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, тм_СообщенияПользователям);
	МЗ.Период = ТекущаяДатаСеанса();
	МЗ.Записать();
	
КонецПроцедуры
