
#Область БонуснаяСистема
// Переопределяем сумму документа с учетом используемых бонусов 

&Перед("ОтразитьДвижения")
Процедура тм_ОтразитьДвижения(ИмяРегистра, ТаблицыДляДвижений, Движения, Отказ)
	
	Попытка		 
		Если ИмяРегистра  = "РасчетыСПокупателями" Тогда
			ТаблицаРасчетыСПокупателями = Неопределено;
			Если ТаблицыДляДвижений.Свойство("ТаблицаРасчетыСПокупателями", ТаблицаРасчетыСПокупателями) Тогда
				Если ТаблицаРасчетыСПокупателями.Количество() = 1 Тогда
					СтрокаТаблицы = ТаблицаРасчетыСПокупателями[0];
					МетаданныеДокумента = СтрокаТаблицы.ДокументОплаты.Метаданные();
					Если ТипЗнч(СтрокаТаблицы.Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Или
						ТипЗнч(СтрокаТаблицы.Документ) = Тип("ДокументСсылка.РасходнаяНакладная")Тогда
						
						Если МетаданныеДокумента = Метаданные.Документы.РасходИзКассы Тогда //Указываем сумму постпуления от документа
							
							// Отключили после обновления 1С
							//
							//СтрокаТаблицы.СуммаПлатежа = СтрокаТаблицы.Документ.СуммаДокумента; 
							//СтрокаТаблицы.СуммаВал     = СтрокаТаблицы.Документ.СуммаДокумента;
							//СтрокаТаблицы.Сумма        = СтрокаТаблицы.Документ.СуммаДокумента;
							//СтрокаТаблицы.СуммаРег	   = СтрокаТаблицы.Документ.СуммаДокумента;	
						Иначе   // Поступление ДС/Приход из кассы
							СуммаДокументаОснования = СтрокаТаблицы.Документ.СуммаДокумента;
							СуммаДокументаОплаты	= СтрокаТаблицы.ДокументОплаты.СуммаДокумента;
							СуммаБонусов = СтрокаТаблицы.Документ.тм_ИспользованныеБонусы;
							
							ПолнаяСуммаСУчетомБонусов = СуммаДокументаОплаты + СуммаБонусов;
							
							СтрокаТаблицы.СуммаПлатежа = ПолнаяСуммаСУчетомБонусов; 
							СтрокаТаблицы.СуммаВал     = ПолнаяСуммаСУчетомБонусов;
							СтрокаТаблицы.Сумма        = ПолнаяСуммаСУчетомБонусов;
							СтрокаТаблицы.СуммаРег	   = ПолнаяСуммаСУчетомБонусов;															
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 				
			КонецЕсли; 
		КонецЕсли;
	Исключение	
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти 
