
&После("ОбработкаЗаполнения")
Процедура тм_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Или 
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ИзменитьСуммуДокументаСУчетомБонусов(ДанныеЗаполнения);
	КонецЕсли; 	 
	
КонецПроцедуры

Процедура ИзменитьСуммуДокументаСУчетомБонусов(ДанныеЗаполнения)

	Если ДанныеЗаполнения.тм_ИспользованныеБонусы = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.СуммаДокумента - ДанныеЗаполнения.тм_ИспользованныеБонусы;
	
	СтрокаТабличнойЧасти = ЭтотОбъект.РасшифровкаПлатежа[0];
	СтрокаТабличнойЧасти.СуммаПлатежа = ЭтотОбъект.СуммаДокумента;
	СтрокаТабличнойЧасти.СуммаРасчетов = ЭтотОбъект.СуммаДокумента;
	
КонецПроцедуры

