
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Сообщить("Привет", СтатусСообщения.ОченьВажное);
	Сообщить("Привет говорю", СтатусСообщения.ОченьВажное);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура Команда1(Команда)
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеВыбора", ЭтаФорма);
	
	Диалог = Новый ДиалогВыбораЦвета();
	Диалог.Показать(ОписаниеОповещенияОЗакрытии);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&Наклиенте
Процедура ПослеВыбора(Рез, Доп) Экспорт
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

