
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Запись.НачисляемыйПроцентБонусов = 3;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Запись.НачисляемыйПроцентБонусов = 0 И Запись.БонусныйСчет.Пустая() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Если указывается процент начисления бонусов, бонусный счет обязателен для заполнения!");
	КонецЕсли; 
	
КонецПроцедуры
