
Функция ДоступныеПодписки(ТипОбъекта, Событие, ИсточникПодписки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ДинамическиеПодписки.КодВыполнения КАК КодВыполнения
		|ИЗ
		|	Справочник.тм_ДинамическиеПодписки.ИсточникиПодписки КАК тм_ДинамическиеПодпискиИсточникиПодписки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тм_ДинамическиеПодписки КАК тм_ДинамическиеПодписки
		|		ПО тм_ДинамическиеПодпискиИсточникиПодписки.Ссылка = тм_ДинамическиеПодписки.Ссылка
		|ГДЕ
		|	тм_ДинамическиеПодписки.Использовать
		|	И тм_ДинамическиеПодписки.ТипОбъекта = &ТипОбъекта
		|	И тм_ДинамическиеПодпискиИсточникиПодписки.ИсточникПодписки = &ИсточникПодписки
		|	И тм_ДинамическиеПодписки.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИсточникПодписки", ИсточникПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции // ДоступныеПодписки()
