
Процедура ПередЗаписью(Отказ, Замещение)

	//Если Замещение Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заменять сообщения запрещено. Создайте новое.'"),,,, Отказ); 
	//	Возврат;
	//КонецЕсли;
	//ИдентификаторСообщения = РегистрыСведений.тм_СообщенияПользователям.ЕстьРанееСозданныйЧат(Пользователи.ТекущийПользователь());
	//
	//Для каждого СтрНабора Из ЭтотОбъект Цикл
	//	
	//	//СтрНабора.ПользовательОтКого 		= Пользователи.ТекущийПользователь();
	//	//СтрНабора.ИдентификаторСообщения 	= ?(ПустаяСтрока(ИдентификаторСообщения), XMLСтрока(Новый УникальныйИдентификатор), ИдентификаторСообщения);
	//	 
	//КонецЦикла;  
	
КонецПроцедуры


