
#Область ОбработчикиСобытий

&После("ПриКопировании")
Процедура тм_ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.тм_ДокументОснованиеНачисленияБонусов = Документы.РасходнаяНакладная.ПустаяСсылка();
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура тм_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ЭтотОбъект.тм_ДокументОснованиеНачисленияБонусов = ДанныеЗаполнения;
	КонецЕсли; 
		
КонецПроцедуры 

&После("ОбработкаУдаленияПроведения")
Процедура тм_ОбработкаУдаленияПроведения(Отказ)
	
	тм_ОбщегоНазначенияВызовСервера.ОтменитьПроведенияДокументовСписанияБонусов(ЭтотОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти