

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КоличествоДоступныхБонусов", КоличествоДоступныхБонусов);
		                                       
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписатьБонусы(Команда)
	
	Если КоличествоБонусов > КоличествоДоступныхБонусов Тогда
		ПоказатьПредупреждение(, "Превышен лимит доступны бонусов на " + Строка(КоличествоБонусов - КоличествоДоступныхБонусов));
		КоличествоБонусов = 0;
		Возврат;
	КонецЕсли; 
	
	ОповеститьОВыборе(КоличествоБонусов);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 
