
#Область ОбработчикиСобытийФормы

&После("ОбработкаЗаполнения")
Процедура тм_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя Тогда
			ИзменитьСуммуДокументаСУчетомБонусов(ДанныеЗаполнения);
		КонецЕсли;	
	КонецЕсли; 	 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьСуммуДокументаСУчетомБонусов(ДанныеЗаполнения) Экспорт

	Если ДанныеЗаполнения.тм_ДокументОснованиеНачисленияБонусов.тм_ИспользованныеБонусы = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СуммаВозвратаКлиенту = РассчитатьСуммуВозврата(ДанныеЗаполнения.тм_ДокументОснованиеНачисленияБонусов, ДанныеЗаполнения);
	ЭтотОбъект.СуммаДокумента = СуммаВозвратаКлиенту;
	
	СтрокаТабличнойЧасти = ЭтотОбъект.РасшифровкаПлатежа[0];
	СтрокаТабличнойЧасти.СуммаПлатежа = СуммаВозвратаКлиенту;
	СтрокаТабличнойЧасти.СуммаРасчетов = СуммаВозвратаКлиенту;
	
	//Если ЭтотОбъект.СуммаДокумента > ДанныеЗаполнения.тм_РасходнаяНакладная.тм_ИспользованныеБонусы Тогда
		//ЭтотОбъект.СуммаДокумента = ЭтотОбъект.СуммаДокумента - ДанныеЗаполнения.тм_РасходнаяНакладная.тм_ИспользованныеБонусы;
		//
		//СтрокаТабличнойЧасти = ЭтотОбъект.РасшифровкаПлатежа[0];
		//СтрокаТабличнойЧасти.СуммаПлатежа = ЭтотОбъект.СуммаДокумента;
		//СтрокаТабличнойЧасти.СуммаРасчетов = ЭтотОбъект.СуммаДокумента;
	//КонецЕсли; 

КонецПроцедуры

Функция РассчитатьСуммуВозврата(РасходнаяНакладная, ПриходнаяНакладная)

	СуммаВозврата = 0;
	
	СуммаПоступления = ПолучитьСуммуПоступленияДенежныхСредств(РасходнаяНакладная);		
	Если СуммаПоступления = 0 Тогда
		ТекстСообщения = "Сумма поступления денежных средств по документу %1 равен 0. Поступлений ДС не было!";
		Сообщить(СтрШаблон(ТекстСообщения, РасходнаяНакладная));
		СуммаВозврата = СуммаПоступления;
	ИначеЕсли СуммаПоступления < ПриходнаяНакладная.СуммаДокумента Тогда
		СуммаВозврата = СуммаПоступления;
		тм_СуммаНачисленияБонусов = ПриходнаяНакладная.СуммаДокумента - СуммаПоступления;
	ИначеЕсли СуммаПоступления >= ПриходнаяНакладная.СуммаДокумента Тогда
		СуммаВозврата = ПриходнаяНакладная.СуммаДокумента;
	КонецЕсли; 
	 
	Возврат СуммаВозврата;	

КонецФункции // РассчитатьСуммуВозврата()

Функция ПолучитьСуммуПоступленияДенежныхСредств(РасходнаяНакладная)

	Сумма = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеВКассу.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеВКассу КАК ПоступлениеВКассу
		|ГДЕ
		|	ПоступлениеВКассу.Проведен
		|	И ПоступлениеВКассу.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", РасходнаяНакладная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Сумма;	
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сумма = Сумма + Выборка.СуммаДокумента;	
	КонецЦикла;
	
	Возврат Сумма;
	 
КонецФункции // ПолучитьСуммуПоступленияДенежныхСредств()

#КонецОбласти 
