
Процедура ОповеститьПользователяОбИзменениях() Экспорт

	Результат = тм_ОбщегоНазначенияВызовСервера.ЕстьНеПрочитанныеПисьма();
	Если Результат.КоличествоНеПрочитано Тогда
		Описание = Новый ОписаниеОповещения("ОткрытьФормуЧата", тм_ОбщегоНазначенияКлиент);
		ТекстСообщения = "Есть не прочитанные сообщения (" + Результат.КоличествоНеПрочитано + ")"
			+ Символы.ПС + "Нажмите, чтобы открыть";
		ПоказатьОповещениеПользователя("Чат", Описание, ТекстСообщения);	
	КонецЕсли; 
	
КонецПроцедуры
                                                     

Процедура ЗаполнитьПрава(Права)Экспорт

	тм_ОбщегоНазначенияВызовСервера.ЗаполнитьПрава(Права);	

КонецПроцедуры
 