
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мМетаданные = Метаданные.Справочники;
	Для каждого СтрМета Из мМетаданные Цикл
		Элементы.Справочники.ПодчиненныеЭлементы.СправочникиНаименованиеСправочника.СписокВыбора.Добавить(СтрМета.Имя, СтрМета.Синоним);
	КонецЦикла;  
	
	мМетаданные = Метаданные.Документы;
	Для каждого СтрМета Из мМетаданные Цикл
		Элементы.Документы.ПодчиненныеЭлементы.ДокументыНаименованиеДокумента.СписокВыбора.Добавить(СтрМета.Имя, СтрМета.Синоним);
	КонецЦикла;  
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти 

