
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаполнитьДвижения();
	
КонецПроцедуры

Процедура ЗаполнитьДвижения()

	Движения.тм_ЗарплатаПоЗаказНарядам.Записывать = Истина;
	Движение = Движения.тм_ЗарплатаПоЗаказНарядам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Сумма = Сумма;
	Движение.Комментарий = Комментарий;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	Если Ссылка.ПометкаУдаления Тогда
		Отказ = Истина;
		Сообщить("Данный документ использовать запрещено!");
	КонецЕсли; 
	 	                                                 	
КонецПроцедуры
