
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УКО_ФормыКлиентСервер_Заголовок(ЭтаФорма, НСтр("ru = 'Экспорт во внешний отчет'; en = 'Export to external report'"));
	ОбъектОбработки().УКО_ПроверкаОшибокВФорме_Инициализировать(ЭтаФорма);
	
	Имя = ИмяФайлаВнешнегоОтчета();
	Синоним = Параметры.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Не ЗначениеЗаполнено(Настройки["Имя"]) Тогда
		Настройки.Вставить("Имя", ИмяФайлаВнешнегоОтчета());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ПриИзмененииДанныхПослеОжидания", 0.1, Истина);	

КонецПроцедуры

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ПриИзмененииДанныхПослеОжидания", 0.1, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СинонимПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ПриИзмененииДанныхПослеОжидания", 0.1, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог = Каталог;
	
	ДиалогВыбораКаталога.Показать(Новый ОписаниеОповещения("ЗавершенВыборКаталога", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УКО_ПроверкаОшибокВФормеКлиент_ОбработкаНавигационнойСсылки(ЭтаФорма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Экспортировать(Команда)
	
	ОшибкиЗаполнения = ПроверкаЗаполнения();
	Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
		
		УКО_ПроверкаОшибокВФормеКлиент_ТекущийЭлементПоПервой(ЭтаФорма, ОшибкиЗаполнения);
		
	Иначе
		
		Результат = Новый Структура;
		Результат.Вставить("ПолноеИмяФайла", СтрШаблон("%1\%2.%3", Каталог, Имя, "erf"));
		Результат.Вставить("Имя", Имя);
		Результат.Вставить("Синоним", Синоним);
		
		Закрыть(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	УКО_ПроверкаОшибокВФормеКлиент_Обновить(ЭтаФорма, ПроверкаЗаполнения());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенВыборКаталога(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Каталог = Результат[0];
	КаталогПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФайлаВнешнегоОтчета()
	
	Возврат НСтр("ru = 'ВнешнийОтчет'; en = 'ExternalReport'");
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполнения()
	
	Результат = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Результат.Добавить("Имя", НСтр("ru = 'Не заполнено имя'; en = 'Name is not filled'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Результат.Добавить("Каталог", НСтр("ru = 'Не указан каталог'; en = 'Directory not specified'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Синоним) Тогда
		Результат.Добавить("Синоним", НСтр("ru = 'Не заполнен синоним'; en = 'Not filled in synonym'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииДанныхПослеОжидания()

	ОбновитьЭлементыФормы();

КонецПроцедуры

#КонецОбласти


&НаСервере
Функция ОбъектОбработки()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
&НаКлиентеНаСервереБезКонтекста
// Возвращает цвет текста важной гиперссылки
//
// Возвращаемое значение:
//   Цвет - Цвет текста
//
Функция УКО_ОбщегоНазначенияКлиентСервер_ЦветТекстаВажнойГиперссылки() Экспорт
	
	Возврат Новый Цвет(125,0,0); 
	
КонецФункции
&НаКлиенте
// Обновляет данные элементов ошибок
//
// Параметры:
//  Форма - Форма - Форма
//  Ошибки - СписокЗначение - Ошибки Значение - имя элемента, Представление - Текст ошибки
//
Процедура УКО_ПроверкаОшибокВФормеКлиент_Обновить(Форма, Ошибки) Экспорт
	
	Результат = Новый Массив;
	КоличествоСтрок = 0;
	Для Каждого Ошибка Из Ошибки Цикл 
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат.Добавить(Символы.ПС);
		КонецЕсли;
		
		ТекстОшибки = Ошибка.Представление;
		КоличествоСтрок = КоличествоСтрок + СтрЧислоСтрок(ТекстОшибки);
		Результат.Добавить(Новый ФорматированнаяСтрока(ТекстОшибки,, УКО_ОбщегоНазначенияКлиентСервер_ЦветТекстаВажнойГиперссылки(),, Ошибка.Значение));
		
	КонецЦикла;
	
	ЭлементОшибки = Форма.Элементы.Ошибки;
	КоличествоОшибок = Ошибки.Количество();
	
	Если ЭлементОшибки.Высота < КоличествоСтрок Тогда
		ЭлементОшибки.Высота = КоличествоСтрок;
	КонецЕсли;

	Форма.Ошибки = Новый ФорматированнаяСтрока(Результат);
	
КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
// Обновляет заголовок формы
//
// Параметры:
//  Форма - Форма - Форма
//  Заголовок - Строка - Заголовок формы
//  Дополнение - Булево - Дополнять заголовок названием расширения
//
Процедура УКО_ФормыКлиентСервер_Заголовок(Форма, Заголовок, Дополнение = Ложь) Экспорт
	
	НовыйЗаголовок = Заголовок;
	
	Если Дополнение Тогда
		НовыйЗаголовок = НовыйЗаголовок + " : " + УКО_ОбщегоНазначенияКлиентСервер_ИмяРасширения();
	КонецЕсли;
	
	Форма.Заголовок = НовыйЗаголовок;
	
КонецПроцедуры
&НаКлиенте
// Обработчик события ОбработкаНавигационнойСсылки
//
// Параметры:
//  Форма - Форма - Форма
//  Элемент - Элемент - Элемент
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - Текст навигационной ссылки
//  СтандартнаяОбработка - Булево - Признак стандартной обработки
//
Процедура УКО_ПроверкаОшибокВФормеКлиент_ОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Форма.ТекущийЭлемент = Форма.Элементы[НавигационнаяСсылкаФорматированнойСтроки];
	
КонецПроцедуры
&НаКлиенте
// Устанавливает текущим первый элемент ошибки
//
// Параметры:
//  Форма - Форма - Форма
//  Ошибки - СписокЗначение - Ошибки Значение - имя элемента, Представление - Текст ошибки
//
Процедура УКО_ПроверкаОшибокВФормеКлиент_ТекущийЭлементПоПервой(Форма, Ошибки) Экспорт
	
	Форма.ТекущийЭлемент = Форма.Элементы[Ошибки[0].Значение];
	
КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
// Возвращает имя расширения
// Возвращаемое значение:
//   Строка	- Имя расширения
Функция УКО_ОбщегоНазначенияКлиентСервер_ИмяРасширения() Экспорт 
	
	Возврат НСтр("ru = 'Управляемая консоль отчетов'; en = 'Managed reporting console'");
	
КонецФункции
