

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.Настройки.ПодчиненныеЭлементы.НастройкиПорог.СписокВыбора.ЗагрузитьЗначения(СформироватьПороги());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПороги()

	Пороги = Новый Массив;
	
	тхтПороги = Справочники.тм_НастройкиУстановкиЦенНоменклатуры.ПолучитьМакет("Пороги");
	
	Для НомерСтроки = 1 По тхтПороги.КоличествоСтрок() Цикл
		СтрокаПорог = тхтПороги.ПолучитьСтроку(НомерСтроки);	
		Пороги.Добавить(СтрокаПорог);	
	КонецЦикла; 
	 
	Возврат Пороги;
	
КонецФункции // СформироватьПороги()

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()

	Объект.Настройки.Очистить();
		
	ПорогиИНаценки = Справочники.тм_НастройкиУстановкиЦенНоменклатуры.ПолучитьМакет("ПорогиИПроцент");
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ПорогиИНаценки.Область());
	Построитель.Выполнить();
	ДанныеСМакета = Построитель.Результат.Выгрузить(); 
	
	Для каждого Стр Из ДанныеСМакета Цикл
		СтрНастройки = Объект.Настройки.Добавить();	
		СтрНастройки.ПорогС  = СтрРазделить(Стр.Порог, "-")[0];
		СтрНастройки.ПорогПо = СтрРазделить(Стр.Порог, "-")[1];
		СтрНастройки.Процент = Число(Стр.Процент);
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьПоШаблонуНаСервере()

&НаКлиенте
Процедура Добавить(Команда)
	
	ОткрытьФорму("Справочник.тм_НастройкиУстановкиЦенНоменклатуры.Форма.ФормаДобавления",,,,,, Новый ОписаниеОповещения("ДобавитьПорогиЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПорогиЗавершение(ПараметрыПередачи, ДопПараметры) Экспорт
	
	Если ПараметрыПередачи = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Объект.Настройки.Добавить(), ПараметрыПередачи);	

КонецПроцедуры // ДобавитьПорогиЗавершение()
 
#КонецОбласти 
