
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли; 

	// регистр тм_БонусныеНакопления Приход
	Движения.тм_БонусныеНакопления.Записывать = Истина;
	Движение = Движения.тм_БонусныеНакопления.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.БонусныйСчет = БонусныйСчет;
	Движение.ПроцентНакопления = ПроцентНакопления;
	Движение.СуммаНакоплений = СуммаБонусов;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
		
КонецПроцедуры


