
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();                                                                         
	УстановитьРеквизитыПоУмолчанию();
	УстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Права = тм_КЭШ.ПолучитьПраваОбъекта("тм_УстановкаЦенРабот", Пользователи.ТекущийПользователь());
	Если Не Права.Запись Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на запись документа'"),,,, Отказ); Возврат;
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()

	Если Объект.СозданАвтоматически Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли; 

КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура УстановитьРеквизитыПоУмолчанию()

	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли; 
		
КонецПроцедуры // УстановитьРеквизитыПоУмолчанию()

&НаСервере
Процедура УстановитьПараметрыВыбора()

	// Не удается указать данный параметр на форме.
	// Пришлось указать данный параметр программно
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Перечисления.ТипыНоменклатуры.Работа);
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", НовыеЗначения);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.РаботыРабота.ПараметрыВыбора = НовыеПараметры;	

КонецПроцедуры // УстановитьПараметрыВыбора()

 
#КонецОбласти 