
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ОткрытьФорму("РегистрСведений.тм_ПраваДоступа.Форма.ФормаДобавления", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// Проверка пользователей
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение.Пользователи) Тогда
		Возврат;	
	КонецЕсли; 
	
	// Проверка прав
	Если Не (ВыбранноеЗначение.Чтение Или ВыбранноеЗначение.Запись Или ВыбранноеЗначение.SA) Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаписатьДанные(ВыбранноеЗначение);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДанные(ВыбранноеЗначение)

	РегистрыСведений.тм_ПраваДоступа.ЗаписатьВыбранныеЗначения(ВыбранноеЗначение);

КонецПроцедуры // ЗаписатьДанные()
 
#КонецОбласти 
