
#Если Сервер Тогда
Функция ПолучитьМакет(ПолноеИмя, ИмяМакета) Экспорт

	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	Возврат МенеджерОбъекта.ПолучитьМакет(ИмяМакета);

КонецФункции // 
#КонецЕсли

Функция ПолучитьПрефиксРасширения() Экспорт

	Возврат "тм_";

КонецФункции // ПрефиксРасширения()
 
Функция ПолучитьПраваОбъекта(Объект, Пользователь) Экспорт
	
	Права = Новый Структура("Чтение, Запись, SA", Ложь, Ложь, Ложь);
	
	#Если Сервер Тогда

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ПраваДоступа.Чтение КАК Чтение,
		|	тм_ПраваДоступа.Запись КАК Запись,
		|	тм_ПраваДоступа.SA КАК SA
		|ИЗ
		|	РегистрСведений.тм_ПраваДоступа КАК тм_ПраваДоступа
		|ГДЕ
		|	тм_ПраваДоступа.Пользователь = &Пользователь
		|	И тм_ПраваДоступа.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Права, Выборка);
	КонецЕсли; 	
	
	#КонецЕсли
	
	Возврат Права;
	
КонецФункции // ПолучитьПраваОбъекта()

Функция СотрудникПользователя(Пользователь) Экспорт
	
	#Если Сервер Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиПользователя.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
			|ГДЕ
			|	СотрудникиПользователя.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сотрудник = Выборка.Сотрудник;	
		КонецЕсли; 
		
		Возврат Сотрудник;
	#Иначе
		Возврат ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	#КонецЕсли

КонецФункции // СотрудникПользователя()

