
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли; 

	ПроверитьОстаткиСуммы(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДвижения();

КонецПроцедуры

Процедура ПроверитьОстаткиСуммы(Отказ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.тм_ЗарплатаПоЗаказНарядам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.УстановитьЗначение("Сотрудник", Сотрудник);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ЗарплатаПоЗаказНарядамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.тм_ЗарплатаПоЗаказНарядам.Остатки(
		|			&ГраницаДок,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК тм_ЗарплатаПоЗаказНарядамОстатки";
	
	Запрос.УстановитьПараметр("ГраницаДок", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Сумма > Выборка.СуммаОстаток Тогда
		ТекстСообщения = СтрШаблон("Не хватает суммы выплаты. Допустимая сумма = %1", Выборка.СуммаОстаток);
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли; 

КонецПроцедуры
                
Процедура ЗаполнитьДвижения()
	
	Движения.тм_ЗарплатаПоЗаказНарядам.Записывать = Истина;
	Движение = Движения.тм_ЗарплатаПоЗаказНарядам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Сумма = Сумма;
	Движение.Комментарий = Комментарий;

КонецПроцедуры
 