
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура тм_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПереопредилитьЗаголовкиЭлементов();
	ПереопределитьЗначенияРеквизитов();
	ДобавитьВставитьЭлементыНаФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура тм_ПриОткрытииПосле(Отказ)
	
	// Установка видимости полей при изменении вида контрагента
	УправлениеФормой();
	УстановитьЗаголовокЮридическихДанных(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ДобавитьПоляКонтактногоЛица(Неопределено);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура тм_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ДанныеКонтактныхЛиц) Тогда
		Если ТекущийОбъект.Покупатель И ТекущийОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
			ТекущийОбъект.Наименование = ВРЕГ(ТекущийОбъект.Наименование);
			ТекущийОбъект.ОсновныеСведения = ВРЕГ(ТекущийОбъект.ОсновныеСведения);
			ТекущийОбъект.ФИО = ВРЕГ(ТекущийОбъект.ФИО);
			ТекущийОбъект.НаименованиеПолное = ВРЕГ(ТекущийОбъект.НаименованиеПолное);
			ДанныеКонтактныхЛиц[0].Наименование = ВРЕГ(ДанныеКонтактныхЛиц[0].Наименование);
		КонецЕсли;   
		
		Если ПустаяСтрока(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление) Тогда		
		ИначеЕсли Не СтрДлина(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление) = 10 Тогда
			ДанныеКонтактныхЛиц.Очистить();
			Сообщить("Длина номера должна составлять 10 символов"); 
			Отказ = Истина;
			//ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = "";
			//ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение  = СтрЗаменить(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение, ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление, "");
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура тм_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(ДанныеКонтактныхЛиц) Тогда
	//	Если ТекущийОбъект.Покупатель И ТекущийОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
	//		ТекущийОбъект.Наименование = ВРЕГ(ТекущийОбъект.Наименование);
	//		ТекущийОбъект.ОсновныеСведения = ВРЕГ(ТекущийОбъект.ОсновныеСведения);
	//		ТекущийОбъект.ФИО = ВРЕГ(ТекущийОбъект.ФИО);
	//		ТекущийОбъект.НаименованиеПолное = ВРЕГ(ТекущийОбъект.НаименованиеПолное);
	//		ДанныеКонтактныхЛиц[0].Наименование = ВРЕГ(ДанныеКонтактныхЛиц[0].Наименование);
	//	КонецЕсли;   
	//	
	//	Если ПустаяСтрока(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление) Тогда		
	//	ИначеЕсли Не СтрДлина(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление) = 10 Тогда
	//		ДанныеКонтактныхЛиц.Очистить();
	//		Сообщить("Длина номера должна составлять 10 символов"); 
	//		Отказ = Истина;
	//		//ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = "";
	//		//ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение  = СтрЗаменить(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение, ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление, "");
	//	КонецЕсли;
	//КонецЕсли; 
	

КонецПроцедуры

&НаСервере
Процедура тм_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	ПереопредилитьЗаголовкиЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеКонтакт_0_КИ_0ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	ИначеЕсли Лев(Текст, 1) = "7" Или Лев(Текст, 1) = "8" Тогда   
		ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = "";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номер должен состоять без 7 или 8";
		Сообщение.Поле  = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Сообщение.ПутьКДанным = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Сообщение.Сообщить();				
	ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Текст) Тогда   
		ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = "";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо вводить ТОЛЬКО цифры";
		Сообщение.Поле  = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Сообщение.ПутьКДанным = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Сообщение.Сообщить();		
	ИначеЕсли СтрДлина(Текст) = 11 Тогда
		ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = Лев(ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление, 10);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Длина номер должна быть 10 символов";
		Сообщение.Поле  = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Сообщение.ПутьКДанным = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Сообщение.Сообщить(); 
	КонецЕсли; 	

КонецПроцедуры // ПриИзменениеТекстаРедактирования()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереопредилитьЗаголовкиЭлементов()

	// Контактный телефон
	КИ_Телефон = Элементы.КонтактнаяИнформацияКонтакт_0.ПодчиненныеЭлементы.Найти("Контакт_0_КИ_0");
	Если Не КИ_Телефон  = Неопределено Тогда		
		ВидКонтакт_0_КИ_0 = КИ_Телефон.ПодчиненныеЭлементы.Найти("ВидКонтакт_0_КИ_0");
		Если Не ВидКонтакт_0_КИ_0 = Неопределено Тогда   
			ВидКонтакт_0_КИ_0.Заголовок = "Моб.";  
			ВидКонтакт_0_КИ_0.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		КонецЕсли; 
		
		ПредставлениеКонтакт_0_КИ_0 = КИ_Телефон.ПодчиненныеЭлементы.Найти("ПредставлениеКонтакт_0_КИ_0");
		Если Не ПредставлениеКонтакт_0_КИ_0 = Неопределено Тогда
			ПредставлениеКонтакт_0_КИ_0.КнопкаВыбора = Ложь;
			ПредставлениеКонтакт_0_КИ_0.ПодсказкаВвода = "Номер без +7 и 8. Только 10 цифр";
			УстановитьСобытияЭлементов(ПредставлениеКонтакт_0_КИ_0);
		КонецЕсли; 
	КонецЕсли; 
	
	// Телефон контрагента
	КомпанияКонтактнаяИнформация = Элементы.Компания.ПодчиненныеЭлементы.Найти("КонтактнаяИнформация");
	Если Не КомпанияКонтактнаяИнформация = Неопределено Тогда
		ЗначенияКонтактнойИнформации = КомпанияКонтактнаяИнформация.ПодчиненныеЭлементы.Найти("ЗначенияКонтактнойИнформации");
		Если Не ЗначенияКонтактнойИнформации = Неопределено Тогда
			Компания_КИ_Телефон = ЗначенияКонтактнойИнформации.ПодчиненныеЭлементы.Найти("КИ_0");
			Если Не Компания_КИ_Телефон = Неопределено Тогда
				ВидКИ_0 = Компания_КИ_Телефон.ПодчиненныеЭлементы.Найти("ВидКИ_0");
				Если Не ВидКИ_0 = Неопределено Тогда  					
					ВидКИ_0.Заголовок = "Раб.";	
					ВидКИ_0.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
				КонецЕсли; 				
			КонецЕсли; 			
		КонецЕсли; 		 
	КонецЕсли;  
	
КонецПроцедуры // ПереопредилитьЗаголовкиЭлементов()

&НаСервере
Процедура УстановитьСобытияЭлементов(Элемент)

	Элемент.УстановитьДействие("ИзменениеТекстаРедактирования", "ПредставлениеКонтакт_0_КИ_0ИзменениеТекстаРедактирования");		

КонецПроцедуры // УстановитьСобытияЭлементов()

&НаСервере
Процедура ИзменитьНомерТелефонаКонтактногоЛица()

	Если ЗначениеЗаполнено(ДанныеКонтактныхЛиц) Тогда
		НомерТелефона = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление;
		Значение = ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение;
		
		Если ПустаяСтрока(НомерТелефона) Тогда
			Возврат;
		ИначеЕсли Не СтрДлина(НомерТелефона) = 10 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Номер телефона введен не корректно.";
			Сообщение.Сообщить(); 
			//ТекущийОбъект.НомерТелефона = "";
			ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = "";
			ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение = "";
		КонецЕсли; 
		
		Если Не ПустаяСтрока(НомерТелефона) Тогда
			бл1 = Лев(НомерТелефона, 3);
			бл2 = Сред(НомерТелефона, 4, 3);
			бл3 = Сред(НомерТелефона, 7, 2);
			бл4 = Сред(НомерТелефона, 9, 2);
			НовыйНомерТелефона = бл1 + "-"	+ бл2 + "-" + бл3 + "-" + бл4;
			ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Представление = НовыйНомерТелефона;
			ДанныеКонтактныхЛиц[0].КонтактнаяИнформация[0].Значение = СтрЗаменить(Значение, НомерТелефона, НовыйНомерТелефона);
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры // ИзменитьНомерТелефонаКонтактногоЛица()

&НаСервере
&После("ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц")
Процедура тм_ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц()
	
	//Скорректируем номер телефона
	ИзменитьНомерТелефонаКонтактногоЛица();	
	
КонецПроцедуры

&НаСервере
Процедура ПереопределитьЗначенияРеквизитов()

	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда		
		Если Объект.Покупатель Тогда
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;	
		КонецЕсли;		
	КонецЕсли; 
		
КонецПроцедуры // ПереопрделитьЗначенияРеквизитов()

&НаСервере
Процедура ДобавитьВставитьЭлементыНаФорму()
	
	ОстатокБонусов = ?(ЗначениеЗаполнено(Параметры.Ключ), тм_ОбщегоНазначенияВызовСервера.ПолучитьОстатокБонусов(Параметры.Ключ), 0);
		
	ЭлементКоличествоБонусов = тм_ОбщегоНазначенияВызовСервера.ДобавитьЭлементНаФорму(ЭтаФорма, 
		"КоличествоБонусов",
		Тип("ДекорацияФормы"),
		ВидДекорацииФормы.Надпись,
		Элементы.ПредставлениеВПрограмме,
		Неопределено); 
		
	ЭлементКоличествоБонусов.Заголовок = "Количество доступных бонусов: " + ОстатокБонусов;
	ЭлементКоличествоБонусов.ЦветТекста = WebЦвета.Красный;
	ЭлементКоличествоБонусов.ЦветФона = WebЦвета.Кремовый;
	
	// Перенос группы контактов
	Элементы.Переместить(Элементы.Контакты, Элементы.Компания);
	
КонецПроцедуры // ДобавитьВставитьЭлементыНаФорму()

&НаКлиенте
&После("ДобавитьПоляКонтактногоЛица")
Процедура тм_ДобавитьПоляКонтактногоЛица(Команда)
	
	ПереопредилитьЗаголовкиЭлементов();
	
КонецПроцедуры


#КонецОбласти 




