
&После("ОбновитьДанныеПанели")
Процедура тм_ОбновитьДанныеПанели(Форма, ВладелецКИ)
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаСпискаЗаказНаряда" Тогда
		
		ДанныеПанелиКонтактнойИнформации = Форма.ДанныеПанелиКонтактнойИнформации;
		тм_РаботаСФормойСервер.ДобавитьИнформациюДополнительныхРеквизитов(Форма.Элементы.Список.ТекущаяСтрока, ДанныеПанелиКонтактнойИнформации);
		КопироватьДанныеФормы(ДанныеПанелиКонтактнойИнформации, Форма.ДанныеПанелиКонтактнойИнформации);
		
	КонецЕсли; 
	//
КонецПроцедуры
