
&После("ПриЗаписи")
Процедура тм_ПриЗаписи(Отказ)
	
	ЗаписатьНастройкиКонтрагента();
	
КонецПроцедуры

Процедура ЗаписатьНастройкиКонтрагента()

	Если Не ЭтотОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Возврат;
	КонецЕсли; 
	
	МЗ = РегистрыСведений.тм_НастройкиКонтрагентов.СоздатьМенеджерЗаписи();
	МЗ.Контрагент = ЭтотОбъект.Ссылка;
	МЗ.Прочитать();
	
	Если ЗначениеЗаполнено(МЗ.БонусныйСчет) Тогда
		Возврат;
	КонецЕсли; 
	
	Отказ = Ложь;
	
	МЗ.Контрагент = ЭтотОбъект.Ссылка;
	МЗ.БонусныйСчет = тм_ОбщегоНазначенияВызовСервера.СоздатьБонусныйСчет(
					  	ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ЭтотОбъект.Код, Истина, Истина),
						ЭтотОбъект.Ссылка,
						Отказ);
						
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	МЗ.НачисляемыйПроцентБонусов = 3;
	МЗ.Записать();
	
КонецПроцедуры // ЗаписатьНастройкиКонтрагента()
 
