
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//
	//Если Не ТекущийОбъект.Владелец.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
	//	ТекущийОбъект.Владелец = Справочники.Контрагенты.ПустаяСсылка();
	//	Отказ = Истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Бонусный счет может иметь только физ. лицо";
	//	Сообщение.Поле  = "Владелец";
	//	Сообщение.ПутьКДанным = "ТекущийОбъект";
	//	Сообщение.Сообщить();
	//ИначеЕсли СтрДлина(ТекущийОбъект.Наименование) < 10 Тогда
	//	Отказ = Истина;
	//	ТекущийОбъект.Наименование = Лев(ТекущийОбъект.Наименование, 10);
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Длина номер должна быть 10 символов";
	//	Сообщение.Поле  = "Наименование";
	//	Сообщение.ПутьКДанным = "ТекущийОбъект";
	//	Сообщение.Сообщить(); 		
	//КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//
	//СтандартнаяОбработка = Ложь;

	//Если ПустаяСтрока(Текст) Тогда
	//	Возврат;
	//ИначеЕсли Лев(Текст, 1) = "7" Или Лев(Текст, 1) = "8" Тогда   
	//	Объект.Наименование = "";
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Номер должен состоять без 7 или 8";
	//	Сообщение.Поле  = "Наименование";
	//	Сообщение.ПутьКДанным = "Объект";
	//	Сообщение.Сообщить();				
	//ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Текст) Тогда   
	//	Объект.Наименование = "";
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Необходимо вводить ТОЛЬКО цифры";
	//	Сообщение.Поле  = "Наименование";
	//	Сообщение.ПутьКДанным = "Объект";
	//	Сообщение.Сообщить();		
	//КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 