
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПользователиИГруппа.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.ТекущийПользователь());

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытьФорму" Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПользователиИГруппаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	Если ВыбраннаяСтрока = 1 Тогда
		ПараметрыФормы.Вставить("СоздатьГруппу", Истина);
	Иначе
		ПараметрыФормы.Вставить("СоздатьГруппу", Ложь);
		ПараметрыФормы.Вставить("ПользовательКому", Элемент.ТекущиеДанные.Кому);
	КонецЕсли; 
	
	ОткрытьФорму("РегистрСведений.тм_СообщенияПользователям.Форма.ФормаЗаписиНовогоСообщения", ПараметрыФормы, ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти