
&После("ПриАктивизацииДинамическогоСписка")
Процедура тм_ПриАктивизацииДинамическогоСписка(Форма, Элемент, ТекущийВладелецКИ, КолонкаВладелецКИ)
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаСпискаЗаказНаряда" Тогда
		
		ВладелецКИАктивнойСтроки = Неопределено;
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			ВладелецКИАктивнойСтроки = Элемент.ТекущиеДанные[КолонкаВладелецКИ];
		КонецЕсли;
		
		Если ВладелецКИАктивнойСтроки = ТекущийВладелецКИ Тогда
			
			ДанныеПанелиКонтактнойИнформации = Форма.ДанныеПанелиКонтактнойИнформации;
			тм_РаботаСФормойСервер.ДобавитьИнформациюДополнительныхРеквизитов(Форма.Элементы.Список.ТекущаяСтрока, ДанныеПанелиКонтактнойИнформации);
			КопироватьДанныеФормы(ДанныеПанелиКонтактнойИнформации, Форма.ДанныеПанелиКонтактнойИнформации);
			
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры
