
#Область ОбработчикиСобытий

&После("ПриКопировании")
Процедура тм_ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.тм_ИспользованныеБонусы = 0;
	ЭтотОбъект.тм_СостояниеРасходнойНакладной = Перечисления.тм_СостояниеРасходнойНакладной.ВРаботе;
		
	тм_ТекущийПользователь = Пользователи.ТекущийПользователь();		
	Для каждого СтрЗапасы Из ЭтотОбъект.Запасы Цикл		
		СтрЗапасы.тм_Сотрудник = тм_КЭШ.СотрудникПользователя(тм_ТекущийПользователь);	
	КонецЦикла;  
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура тм_ОбработкаУдаленияПроведения(Отказ)
	
	тм_ОбщегоНазначенияВызовСервера.ОтменитьПроведенияДокументовСписанияБонусов(ЭтотОбъект.Ссылка);
	
КонецПроцедуры
 
&После("ПередЗаписью")
Процедура тм_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Права = тм_КЭШ.ПолучитьПраваОбъекта("РасходнаяНакладная", Пользователи.ТекущийПользователь());	
	
	//Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) И (Не Права.SA) Тогда
	Если Не Права.SA И Ссылка.тм_СостояниеРасходнойНакладной = Перечисления.тм_СостояниеРасходнойНакладной.Завершен Тогда
		Сообщить("Документ в статусе завершен. Изменение документа невозможно!");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура тм_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//тм_СостояниеРасходнойНакладной = Перечисления.тм_СостояниеРасходнойНакладной.ВРаботе;	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		//И Не ДанныеЗаполнения.Свойство("ВидОперации") Тогда  // Не ДанныеЗаполнения.Свойство("ВидОперации") - исключаем заказ-наряды
		ЭтотОбъект.Ответственный = тм_КЭШ.СотрудникПользователя(Пользователи.ТекущийПользователь());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Для каждого СтрЗапас Из ДанныеЗаполнения.Запасы Цикл
			ИскомаяСтрока = ЭтотОбъект.Запасы.Найти(СтрЗапас.Номенклатура, "Номенклатура");
			Если ИскомаяСтрока <> Неопределено Тогда
				ИскомаяСтрока.тм_Сотрудник = СтрЗапас.тм_Сотрудник;	
			КонецЕсли; 
		КонецЦикла;  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда		
		Для каждого СтрЗапас Из ЭтотОбъект.Запасы Цикл
			СтрЗапас.тм_Сотрудник = тм_КЭШ.СотрудникПользователя(ДанныеЗаполнения.Автор);	
		КонецЦикла;  						
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 
